{"spell": [
  {
    "duration": [{
      "duration": {
        "amount": "minute.",
        "type": "minute."
      },
      "concentration": true,
      "type": "timed"
    }],
    "entries": [
      "Brisk Blades",
      "1st-level transmutation",
      "As part of casting this spell, you can unsheathe two light melee weapons. These blades become wreathed in a sharp wind, which extend beyond the end of the blade. Until the spell ends the damage die for these weapons become {@dice 1d10} and these weapons become magical, if they weren't already."
    ],
    "components": {"v": true},
    "source": "Magical Martial Maneuvers", "level":"1",
    "school": "T",
    "name": "Brisk Blades",
    "range": {
      "distance": {},
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "reaction",
      "condition": " when you start your turn"
    }]
  },
  {
    "duration": [{
      "duration": {
        "amount": "round",
        "type": "round"
      },
      "type": "timed"
    }],
    "entries": [
      "Dark Pounce",
      "1st-level conjuration",
      "The first time before the end of your next turn you make a running jump, you instead teleport to your landing location. If this jump would take you into a Large or smaller creature's space you appear in an unoccupied space in front of the creature (if there is none, the spell fails). The target must make a Strength saving throw. On a failure, the target falls {@condition prone} and if you have a free hand, is {@condition grappled} by you."
    ],
    "components": {"v": true},
    "entriesHigherLevel": [{
      "entries": ["At Higher Levels. When you cast this spell using a 3rd-level slot or higher, you can cast it with a bonus action."],
      "name": "At Higher levels",
      "type": "entries"
    }],
    "source": "Magical Martial Maneuvers", "level":"1",
    "school": "C",
    "name": "Dark Pounce",
    "range": {
      "distance": {},
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "action"
    }]
  },
  {
    "duration": [{"type": "special"}],
    "entries": [
      "Fade Assault",
      "1st-level illusion",
      "As part of the action used to cast the spell you can take the hide action. Your presence slowly fades from existence as a mirage forms around your body. Creatures have disadvantage on Wisdom (perception) checks to detect you until the start of your next turn. Additionally, you are {@condition invisible} for the duration of your next turn. Anything you are wearing or carrying is {@condition invisible} as long as it is on your person."
    ],
    "components": {"s": true},
    "source": "Magical Martial Maneuvers", "level":"1",
    "school": "I",
    "name": "Fade Assault",
    "range": {
      "distance": {},
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "action"
    }]
  },
  {
    "duration": [{"type": "instant"}],
    "entries": [
      "Far Reach",
      "1st-level conjuration",
      "Numerous octarine tentacles spring from your hand towards a target within range. Upon impact, they attempt to close the distance between you and your target.",
      "Make a melee spell attack. On a hit, the target takes {@dice 2d8} piercing damage and a Large or smaller target is pulled up to 10 feet in a straight line toward you. If the attack misses, the target is huge or larger, or if you intentionally aim at terrain, you move up to 10 feet in a straight line towards your target."
    ],
    "components": {"v": true},
    "entriesHigherLevel": [{
      "entries": ["At Higher Levels. When you cast this spell using a spell slot of 3rd level or higher, the damage increases by {@dice 1d8} for each slot level above second."],
      "name": "At Higher levels",
      "type": "entries"
    }],
    "source": "Magical Martial Maneuvers", "level":"1",
    "school": "C",
    "name": "Far Reach",
    "range": {
      "distance": {
        "amount": "15",
        "type": "feet"
      },
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "action"
    }]
  },
  {
    "duration": [{
      "duration": {
        "amount": "minute",
        "type": "minute"
      },
      "concentration": true,
      "type": "timed"
    }],
    "entries": [
      "Grasp of the Spectre",
      "1st-level conjuration",
      "The weapons in your hands glow with an ethereal light, which persist briefly even when they leave your hands. At the end of your turn, you can choose for any weapons you have thrown in the last turn to teleport to your hands or back into their sheaths.",
      "If you hit with a weapon it instead stays transfixed in the target until the end of your next turn. You can use your action to wrench all such weapons back, dealing {@dice 2d8} force damage for each weapon."
    ],
    "components": {"v": true},
    "entriesHigherLevel": [{
      "entries": ["At Higher Levels. When you cast this spell using a spell slot of 3rd level or higher, the damage increases by {@dice 1d8} for each slot level above second."],
      "name": "At Higher levels",
      "type": "entries"
    }],
    "source": "Magical Martial Maneuvers", "level":"1",
    "school": "C",
    "name": "Grasp of the Spectre",
    "range": {
      "distance": {},
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "action"
    }]
  },
  {
    "duration": [{
      "duration": {
        "amount": "minute",
        "type": "minute"
      },
      "type": "timed"
    }],
    "entries": [
      "Illusory feint",
      "1st-level illusion",
      "You conjure fleeting illusions of attacks or movement: a feint. On each of your turns after you cast this spell, you can use a bonus action to grant yourself advantage on one attack roll you make. Alternatively, you can use your bonus action to prevent a creature within 5 feet of you from taking reactions until the end of your next turn.",
      "The target makes a Intelligence saving throw. If they succeed the target can’t be deceived by you with this spell any longer. They can see through the image, and its other sensory qualities become faint to the creature. The spell no longer has any effect on the creature. A creature is unaffected by this spell if it can’t see, if it relies on senses other than sight, such as blind sight, or if it can perceive illusions as false, as with true sight."
    ],
    "components": {"v": true},
    "source": "Magical Martial Maneuvers", "level":"1",
    "school": "I",
    "name": "Illusory feint",
    "range": {
      "distance": {},
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "action."
    }]
  },
  {
    "duration": [{"type": "instant"}],
    "entries": [
      "Jaunt",
      "1st-level evocation",
      "You move in a flash of movement, appearing to have teleported to the untrained eye. You can move up to 15 feet with opportunity attacks provoked by this movement made at disadvantage. After moving, you can make a melee spell attack at a target within range. On a hit, the target takes {@dice 2d6} lightning damage and a Large or smaller creature is pushed away the same distance (the distance you moved).",
      "",
      "If the creature is pushed into a place already occupied by an object or a creature, it and the target takes an additional {@dice 1d6} bludgeoning damage and stops."
    ],
    "components": {"v": true},
    "entriesHigherLevel": [{
      "entries": ["At Higher Levels. When you cast this spell using a spell slot of 2nd or higher the distance you move increases by 15 feet for each spell level above 1st."],
      "name": "At Higher levels",
      "type": "entries"
    }],
    "source": "Magical Martial Maneuvers", "level":"1",
    "school": "V",
    "name": "Jaunt",
    "range": {
      "distance": {
        "amount": "5",
        "type": "feet"
      },
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "action"
    }]
  },
  {
    "duration": [{
      "duration": {
        "amount": "minute",
        "type": "minute"
      },
      "concentration": true,
      "type": "timed"
    }],
    "entries": [
      "Lashing Bind",
      "1st-level conjuration",
      "Make a melee spell attack at a creature in range, dealing {@dice 3d6} slashing damage on a hit. If you hit, the creature must make a Strength saving throw the first time each round that it tries to move away from you. On a failed save, its speed is reduced to zero until the start of its next turn. Additionally, you can target the creature with spells with a range of touch even when it is not within your reach.",
      "The spell ends when the creature moves out of the range of this spell."
    ],
    "components": {"v": true},
    "entriesHigherLevel": [{
      "entries": ["At Higher Levels. When you cast this spell using a spell slot of 2nd or higher the damage increases by {@dice 1d6} for each spell level above 1st."],
      "name": "At Higher levels",
      "type": "entries"
    }],
    "source": "Magical Martial Maneuvers", "level":"1",
    "school": "C",
    "name": "Lashing Bind",
    "range": {
      "distance": {
        "amount": "15",
        "type": "feet"
      },
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "action"
    }]
  },
  {
    "duration": [{
      "duration": {
        "amount": "minute",
        "type": "minute"
      },
      "concentration": true,
      "type": "timed"
    }],
    "entries": [
      "Runic Armor",
      "1st-level transmutation",
      "You inscribe a small glowing rune on one set of non-magical armor. For the duration of the spell, the armor becomes magical and can't be affected by other spells unless you choose for it to be. You have a +1 to AC and advantage on concentration checks while wearing this armor.",
      "Until the spell ends, you can use a bonus action to speak a command word and don the armor instantly. The armor pieces assemble around you, piece by piece, ending with the helmet if it has one. If you end the spell, you can choose to magically doff the armor as well, which folds neatly into a pack."
    ],
    "components": {"v": true},
    "entriesHigherLevel": [{
      "entries": ["At Higher Levels. If you use a spell slot of 3rd level or higher, the Duration is 1 hour. If you use a spell slot of 5th level or higher, the Duration is 24 hours. If you use a 9th level spell slot, the spell lasts until it is dispelled. Using a spell slot of 5th level or higher grants a Duration that doesn't require Concentration."],
      "name": "At Higher levels",
      "type": "entries"
    }],
    "source": "Magical Martial Maneuvers", "level":"1",
    "school": "T",
    "name": "Runic Armor",
    "range": {
      "distance": {},
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "action"
    }]
  },
  {
    "duration": [{
      "duration": {
        "amount": "minute.",
        "type": "minute."
      },
      "concentration": true,
      "type": "timed"
    }],
    "entries": [
      "Toxic Grip",
      "1st-level transmutation (ritual)",
      "You harness your spellcasting to magically sequester poison into your hands. Until the spell ends, you can use your bonus action to have poison flow onto any melee weapons you are holding. A creature you hit with a {@condition poisoned} slashing or piercing weapon takes an additional {@dice 1d4} poison damage.",
      "The poison lasts for the duration of the spell. If this spell is cast as a ritual its duration is concentration, up to an hour."
    ],
    "components": {"s": true},
    "source": "Magical Martial Maneuvers", "level":"1",
    "school": "T",
    "name": "Toxic Grip",
    "range": {
      "distance": {},
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "action"
    }]
  },
  {
    "duration": [{
      "duration": {
        "amount": "minute.",
        "type": "minute."
      },
      "concentration": true,
      "type": "timed"
    }],
    "entries": [
      "Veins of Vigor",
      "1st-level transmutation",
      "Dark fluid runs through your body, which becomes supernaturally enhanced. You use your spellcasting ability modifier for the attack and damage rolls of unarmed strikes. When you use the Attack action with an unarmed strike on your turn, you can make one unarmed strike as a bonus action."
    ],
    "components": {"v": true},
    "entriesHigherLevel": [{
      "entries": ["At Higher Levels. When you cast this spell using a spell slot 2nd or higher, you can roll a {@dice 1d4} in place of the normal damage of your unarmed strike. You use your spellcasting ability modifier in place of Strength or Dexterity for checks you make. When you cast this spell using a 3rd-level slot or higher, it is no longer concentration."],
      "name": "At Higher levels",
      "type": "entries"
    }],
    "source": "Magical Martial Maneuvers", "level":"1",
    "school": "T",
    "name": "Veins of Vigor",
    "range": {
      "distance": {},
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "action"
    }]
  },
  {
    "duration": [{
      "duration": {
        "amount": "minute",
        "type": "minute"
      },
      "concentration": true,
      "type": "timed"
    }],
    "entries": [
      "Wrought Wound",
      "1st-level necromancy",
      "As part of the action used to cast this spell, you must make a melee attack with a weapon against one creature within range, otherwise the spell fails. On a hit, the target suffers the attack's normal effects. Roll 5d8. If the creature's remaining hit points are less than this roll, the wound is magically enhanced. As long as you remain concentrating on this spell, that creature takes {@dice 1d8} psychic damage at the end of its turns. This effect ends immediately if the creature receives magical healing."
    ],
    "components": {"v": true},
    "entriesHigherLevel": [{
      "entries": ["At Higher Levels. When you cast this spell using a spell slot of 2nd or higher, the effect ends when the creature receives magical healing cast at a level equal to or higher than that used to cast Wrought Wound. In addition, roll an additional {@dice 1d8} for each slot level above 1st."],
      "name": "At Higher levels",
      "type": "entries"
    }],
    "source": "Magical Martial Maneuvers", "level":"1",
    "school": "N",
    "name": "Wrought Wound",
    "range": {
      "distance": {
        "amount": "5",
        "type": "feet"
      },
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "action"
    }]
  },
  {
    "duration": [{
      "duration": {
        "amount": "minute.",
        "type": "minute."
      },
      "type": "timed"
    }],
    "entries": [
      "Blood Barrier",
      "2nd-level necromancy",
      "You sacrifice some of your life essence and evoke a shimmering sanguine shield. Roll 3d6. Your maximum hit points and current hit points are reduced by up to this number (you choose). You gain a barrier that has hit points equal to this number. Whenever you take damage, the barrier takes the damage instead. The barrier counts as a separate creature for the purpose of maintaining concentration.",
      "If this damage reduces the barrier to 0 hit points, you take any remaining damage. Additionally, a tide of crimson blood streaks outwards, transfixing creatures in your proximity. Creatures within 5 feet of you must succeed on a Dexterity saving throw or take {@dice 3d6} necrotic damage."
    ],
    "components": {"v": true},
    "entriesHigherLevel": [{
      "entries": ["At Higher Levels. When you cast this spell using a spell slot of 3rd level or higher, you roll an additional {@dice 1d6} for the barrier and damage of the spell for each slot level above"],
      "name": "At Higher levels",
      "type": "entries"
    }],
    "source": "Magical Martial Maneuvers", "level":"2",
    "school": "N",
    "name": "Blood Barrier",
    "range": {
      "distance": {
        "amount": "15",
        "type": "feet"
      },
      "type": "cube"
    },
    "time": [{
      "number": "1",
      "unit": "bonus action"
    }]
  },
  {
    "duration": [{
      "duration": {
        "amount": "minutes.",
        "type": "minutes."
      },
      "concentration": true,
      "type": "timed"
    }],
    "entries": [
      "Dark Javelin",
      "2nd-level evocation",
      "You weave the material into 3 barbed harpoons, constructed from intricate twisted material. They float in the air above your head for the spell's duration. When you cast the spell, and as an action on a subsequent turn, you can direct a harpoon to hurl at target a within range. Make a ranged spell attack. On a hit, the creature takes {@dice 3d6} necrotic damage and must succeed on a Dexterity saving throw or the harpoon lodges into them.",
      "",
      "A creature's speed is reduced by half if a harpoon is lodged in them. The target can use its action to pull any number of harpoons out, taking an additional {@dice 3d6} necrotic damage for each harpoon."
    ],
    "components": {"s": true},
    "entriesHigherLevel": [{
      "entries": ["At Higher Levels. When you cast this spell using a spell slot of 3rd level or higher, the number of harpoons created increases by one for each slot level above second."],
      "name": "At Higher levels",
      "type": "entries"
    }],
    "source": "Magical Martial Maneuvers", "level":"2",
    "school": "V",
    "name": "Dark Javelin",
    "range": {
      "distance": {
        "amount": "90",
        "type": "feet"
      },
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "action"
    }]
  },
  {
    "duration": [{"type": "instant"}],
    "entries": [
      "Dissociative Strike",
      "2nd-level transmutation",
      "The next time you make a melee weapon attack you can instead swing into the air in front of you and project the attack forward.",
      "Each creature within a 5-foot-wide 30-foot-long line, emanating from you, must make a Dexterity saving throw starting from the creature closest to you. The first creature that fails takes {@dice 2d10} force damage and the damage of your attack as if you had hit."
    ],
    "components": {"s": true},
    "entriesHigherLevel": [{
      "entries": ["At Higher Levels. When you cast this spell using a spell slot of 3rd level or higher, you deal an additional {@dice 1d10} damage for each slot level above second."],
      "name": "At Higher levels",
      "type": "entries"
    }],
    "source": "Magical Martial Maneuvers", "level":"2",
    "school": "T",
    "name": "Dissociative Strike",
    "range": {
      "distance": {
        "amount": "30",
        "type": "feet"
      },
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "bonus action"
    }]
  },
  {
    "duration": [{
      "duration": {
        "amount": "minute.",
        "type": "minute."
      },
      "type": "timed"
    }],
    "entries": [
      "Ether Vault",
      "2nd-level transmutation",
      "Ethereal light emanates from limbs as your movement become as light and and swift as a breeze. For the duration, opportunity attacks you provoke are made at disadvantage, and you have advantage on Dexterity (Acrobatics) checks.",
      "Once before the spell ends, you can choose to gain a flying speed of 30 feet (no action required). While flying in this way, you do not provoke opportunity attacks, and you have advantage on any attacks you make.",
      "At the end of this movement, the spell ends, and if you are in the air you land safely back on the ground in an unoccupied space of your choice within 15 feet of the location directly beneath you."
    ],
    "components": {"v": true},
    "source": "Magical Martial Maneuvers", "level":"2",
    "school": "T",
    "name": "Ether Vault",
    "range": {
      "distance": {},
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "bonus action"
    }]
  },
  {
    "duration": [{
      "duration": {
        "amount": "minute.",
        "type": "minute."
      },
      "concentration": true,
      "type": "timed"
    }],
    "entries": [
      "Feral Rage",
      "2nd-level transmutation",
      "You choose one beast within range, which turns feral. The beast gains advantage on Strength Checks and Strength saving throws, resistance to bludgeoning, piercing, and slashing damage, and gains a +2 bonus to the damage rolls of its melee attacks.",
      "An unwilling creature that succeeds on a Wisdom saving throw is unaffected. On a failure, on each of its turns it must move towards and attack the closest creature. The target can repeat the Wisdom saving throw at the end of each of its turns. On a success, the spell ends. This spell has no effect on a creature with an Intelligence score higher than 5."
    ],
    "components": {"v": true},
    "entriesHigherLevel": [{
      "entries": ["At Higher Levels. When you cast this spell using a spell slot of 3rd level or higher, the damage bonus increases by 1 for each spell level above second."],
      "name": "At Higher levels",
      "type": "entries"
    }],
    "source": "Magical Martial Maneuvers", "level":"2",
    "school": "T",
    "name": "Feral Rage",
    "range": {
      "distance": {},
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "action"
    }]
  },
  {
    "duration": [{
      "duration": {
        "amount": "hour",
        "type": "hour"
      },
      "concentration": true,
      "type": "timed"
    }],
    "entries": [
      "Honed Edge",
      "2nd-level transmutation",
      "You magically hone your blade to the point that it passes through bone and sinew as if through air. Your attacks with that weapon within the spells duration deal an additional {@dice 2d8} force damage. If you rolled a one on any of these d8s, the magic preserving the edge fails, and the spell ends."
    ],
    "components": {"v": true},
    "entriesHigherLevel": [{
      "entries": ["At Higher Levels. When you cast this spell using a spell slot of 3rd level or higher, the spell does an additional {@dice 1d8} force damage for each spell level above second."],
      "name": "At Higher levels",
      "type": "entries"
    }],
    "source": "Magical Martial Maneuvers", "level":"2",
    "school": "T",
    "name": "Honed Edge",
    "range": {
      "distance": {},
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "action"
    }]
  },
  {
    "duration": [{
      "duration": {
        "amount": "minute",
        "type": "minute"
      },
      "concentration": true,
      "type": "timed"
    }],
    "entries": [
      "Spell Flux",
      "2nd-level abjuration",
      "You start projecting a protective magical force which emanates from your hand. You have half cover from attacks and damaging effects you can see, but cannot use your hand in any other way, except for somatic components of spells you cast. You also gain no benefit from a shield.",
      "If a ranged attack hits the spell flux (the attack would have hit your original AC but misses your AC with the +2 bonus from cover) you can use your reaction to deflect the blow. Make a ranged spell attack on a creature of your choice within 30 feet of you, dealing the damage and effect of the original attack on a hit.",
      "If you lose concentration on this spell before the end of its duration, you can reweave the lingering magical energies on a subsequent turn using your action. The spell's effects resume until you lose concentration again."
    ],
    "components": {"v": true},
    "entriesHigherLevel": [{
      "entries": ["At Higher Levels. When you cast this spell using a spell slot of 5th level or higher, the spell grants three-quarter cover."],
      "name": "At Higher levels",
      "type": "entries"
    }],
    "source": "Magical Martial Maneuvers", "level":"2",
    "school": "A",
    "name": "Spell Flux",
    "range": {
      "distance": {},
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "bonus action"
    }]
  },
  {
    "duration": [{
      "duration": {
        "amount": "minute",
        "type": "minute"
      },
      "concentration": true,
      "type": "timed"
    }],
    "entries": [
      "Sinister Blade",
      "2nd-level enchantment",
      "As a reaction to a hostile creature coming into range, or a creature in range becoming hostile, you unsheathe part of your blade. You imbue this simple implication with a magically binding threat. That creature can choose to end its turn immediately and be {@condition charmed} by you until the spell ends or until you or your companions do something harmful to it or its allies.",
      "If it isn't charmed, it must make a Wisdom saving throw. On a failed save, the creature is {@condition frightened} of you and you have advantage on melee attack rolls against it. At the end of each of its turns, the target can make another Wisdom saving throw. On a success, the spell ends on the target."
    ],
    "components": {"s": true},
    "entriesHigherLevel": [{
      "entries": ["At Higher Levels. When you cast this spell using a spell slot of 5th level or higher, the spell does not require concentration."],
      "name": "At Higher levels",
      "type": "entries"
    }],
    "source": "Magical Martial Maneuvers", "level":"2",
    "school": "E",
    "name": "Sinister Blade",
    "range": {
      "distance": {
        "amount": "15",
        "type": "feet"
      },
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "reaction"
    }]
  },
  {
    "duration": [{"type": "instant"}],
    "entries": [
      "Psi Blade",
      "2nd-level evocation",
      "You coalesce an aquamarine blade of distilled pain, having the unique property of phasing through armor and carapace. When you cast this spell, you make a melee spell attack at a creature within range. You treat your target as having AC of 10 + their Dexterity modifier. On a hit you deal {@dice 2d12} psychic damage."
    ],
    "components": {"s": true},
    "entriesHigherLevel": [{
      "entries": ["At Higher Levels. When you cast this spell using a spell slot of 3rd level or higher, you deal an additional {@dice 1d12} damage for each slot level above second."],
      "name": "At Higher levels",
      "type": "entries"
    }],
    "source": "Magical Martial Maneuvers", "level":"2",
    "school": "V",
    "name": "Psi Blade",
    "range": {
      "distance": {
        "amount": "5",
        "type": "feet"
      },
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "action"
    }]
  },
  {
    "duration": [{
      "duration": {
        "amount": "minute.",
        "type": "minute."
      },
      "concentration": true,
      "type": "timed"
    }],
    "entries": [
      "Strikethrough",
      "2nd-level Conjuration",
      "Until the spell ends, when you make an melee attack on a target, your attack deals an additional {@dice 1d8} force damage. Additionally, on a hit, you can teleport to an unoccupied space within 5 feet of your target. This effect only only occurs on the first attack against the target during that turn.",
      "If you teleport at least 10 feet, you discombubulate the target, who isn't able to make an opportunity attack against you until the start of its next turn."
    ],
    "components": {"v": true},
    "source": "Magical Martial Maneuvers", "level":"2",
    "school": "C",
    "name": "Strikethrough",
    "range": {
      "distance": {},
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "bonus action"
    }]
  },
  {
    "duration": [{
      "duration": {
        "amount": "minute.",
        "type": "minute."
      },
      "concentration": true,
      "type": "timed"
    }],
    "entries": [
      "Spellsword's Incantation",
      "2nd-level evocation",
      "Your hands exhume magical vapors, which coat any weapons you are holding and flare up when you attack. Until the spell ends, you deal an extra {@dice 1d4} damage whenever you hit a creature with a melee attack, and your melee attacks gain a reach of 10 feet.",
      "If you have a free hand, you can expel this force outwards with a gesture. When you take the Attack action and attack with a melee weapon held in one hand, you can use a bonus action to attack with an unarmed strike with a reach of 10 feet. You use your spellcasting modifier for attack and damage rolls for this attack."
    ],
    "components": {"v": true},
    "entriesHigherLevel": [{
      "entries": ["At Higher Levels. When you cast this spell using a spell slot of 3rd level or higher, you deal an additional {@dice 1d6} damage for each slot level above second."],
      "name": "At Higher levels",
      "type": "entries"
    }],
    "source": "Magical Martial Maneuvers", "level":"2",
    "school": "V",
    "name": "Spellsword's Incantation",
    "range": {
      "distance": {},
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "action"
    }]
  },
  {
    "duration": [{
      "duration": {
        "amount": "round",
        "type": "round"
      },
      "type": "timed"
    }],
    "entries": [
      "Windward Blade",
      "2nd-level evocation",
      "You imbue your blade with the quality of the Elemental Plane of Air, and make vicious rising slash. A creature within range must make a Dexterity saving throw. On a failure it is suspended several inches off the floor. Until the end of its next turn it can't take reactions and is restrained.",
      "As a bonus action you can make a melee spell attack against the same target if you are within 5 feet of it, dealing {@dice 4d6} damage on a hit and ending the spell."
    ],
    "components": {"v": true},
    "entriesHigherLevel": [{
      "entries": ["At Higher Levels. When you cast this spell using a spell slot of 3rd level or higher, you deal an additional {@dice 2d6} damage for each slot level above second."],
      "name": "At Higher levels",
      "type": "entries"
    }],
    "source": "Magical Martial Maneuvers", "level":"2",
    "school": "V",
    "name": "Windward Blade",
    "range": {
      "distance": {
        "amount": "15",
        "type": "feet"
      },
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "action"
    }]
  },
  {
    "duration": [{"type": "instant"}],
    "entries": [
      "Arcane Joust",
      "3rd-level evocation",
      "You flash forward with a blur of speed before reappearing in your original location. Make a melee spell attack on all creatures in a 30 feet long and 15 feet wide area emanating from you in a direction you choose, with a separate attack roll for each target. On a hit you deal {@dice 6d6} piercing damage."
    ],
    "components": {"v": true},
    "entriesHigherLevel": [{
      "entries": ["At Higher Levels. When you cast this spell using a spell slot of 4th level or higher, the damage of the spell attack increases by {@dice 1d10} for each slot level above the third."],
      "name": "At Higher levels",
      "type": "entries"
    }],
    "source": "Magical Martial Maneuvers", "level":"3",
    "school": "V",
    "name": "Arcane Joust",
    "range": {
      "distance": {
        "amount": "30",
        "type": "feet"
      },
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "action"
    }]
  },
  {
    "duration": [{
      "duration": {
        "amount": "hour.",
        "type": "hour."
      },
      "concentration": true,
      "type": "timed"
    }],
    "entries": [
      "Bestial Brand",
      "3rd-level enchantment",
      "You touch a beast or monstrosity at least one size larger than you and bind it to your will as a mount. Roll 5d8. If the creature's remaining hit points are less than this roll, you can clamber onto the creature as part of the action used to cast the spell. As long as you keep one hand on the mount and its hit points are below your roll, it is {@condition charmed} by you and you can control the creature as your mount which accepts you as a rider.",
      "You can use your action to take total and precise control of the target. Until the end of your next turn, the creature takes only the actions you choose, and doesn't do anything that you don't allow it to do. During this time, you can also cause the creature to use a reaction, but this requires you to use your own reaction as well."
    ],
    "components": {"v": true},
    "entriesHigherLevel": [{
      "entries": ["At Higher Levels. When you cast this spell using a spell slot of 4th level or higher, the roll an additional {@dice 1d8} for each slot level above the third."],
      "name": "At Higher levels",
      "type": "entries"
    }],
    "source": "Magical Martial Maneuvers", "level":"3",
    "school": "E",
    "name": "Bestial Brand",
    "range": {
      "distance": {},
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "action"
    }]
  },
  {
    "duration": [{"type": "instant"}],
    "entries": [
      "Grasp of the Wind",
      "3rd-level evocation",
      "You call upon the wind to aid you. Each creature you choose within range must make a Strength saving throw. On a failure, they take {@dice 4d8} bludgeoning damage and are pulled up to 15 feet in a straight line towards you. Your next attack on a creature that fails before the end of your turn is at advantage. On a success, they take half damage and suffer no other effects."
    ],
    "components": {"v": true},
    "entriesHigherLevel": [{
      "entries": ["At Higher Levels. When you cast this spell using a spell slot of 4th level or higher, the damage of the spell attack increases by {@dice 1d8} for each slot level above the third."],
      "name": "At Higher levels",
      "type": "entries"
    }],
    "source": "Magical Martial Maneuvers", "level":"3",
    "school": "V",
    "name": "Grasp of the Wind",
    "range": {
      "distance": {},
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "bonus action"
    }]
  },
  {
    "duration": [{"type": "instant"}],
    "entries": [
      "Ghostly Dirk",
      "3rd-level illusion",
      "Choose one creature that can see you within range. You teleport to an unoccupied location within 5 feet of the target or else the spell fails. Make a melee spell attack, dealing {@dice 3d10} psychic damage on a hit. Regardless of a hit or miss, the target must succeed on a Wisdom Saving throw or be {@condition frightened} until the end of your next turn."
    ],
    "components": {"v": true},
    "entriesHigherLevel": [{
      "entries": ["At Higher Levels. When you cast this spell using a spell slot of 4th level or higher, the range of the spell doubles for each slot level above the third."],
      "name": "At Higher levels",
      "type": "entries"
    }],
    "source": "Magical Martial Maneuvers", "level":"3",
    "school": "I",
    "name": "Ghostly Dirk",
    "range": {
      "distance": {
        "amount": "120",
        "type": "feet"
      },
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "action"
    }]
  },
  {
    "duration": [{"type": "instant"}],
    "entries": [
      "Lance of Light",
      "3rd-level evocation",
      "Light condenses on your weapon, elongating it into a lance of dazzling light. You point this weapon in a direction of your choice, and then near instantly travel along a line 30 feet long in that direction. If you point at a creature within range, it must succeed on a Constitution saving throw or be {@condition blinded} until the end of your turn.",
      "If you would impact a creature along the way, your movement stops early and you must immediately make a melee weapon attack against that creature, using the weapon used in the casting. On a hit, the target takes an additional {@dice 4d6} radiant damage plus {@dice 1d6} radiant damage for every 15 feet traveled along the line. If you impact a solid surface, you stop and can choose to not make the attack."
    ],
    "components": {"s": true},
    "entriesHigherLevel": [{
      "entries": ["At Higher Levels. When you cast this spell using a spell slot of 4th level or higher, the spell's range increases by 30 for each slot level above the third."],
      "name": "At Higher levels",
      "type": "entries"
    }],
    "source": "Magical Martial Maneuvers", "level":"3",
    "school": "V",
    "name": "Lance of Light",
    "range": {
      "distance": {
        "amount": "60",
        "type": "feet"
      },
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "action"
    }]
  },
  {
    "duration": [{"type": "instant"}],
    "entries": [
      "Meteor Drop",
      "3rd-level evocation",
      "You leap up into the air and slam down in an unoccupied location within range. You don't provoke opportunity attacks with this movement, and you can't use this spell if there isn't at least 10 feet of open space directly above you. Creatures within 10 feet of the target location must make a Dexterity saving throw. A target takes {@dice 4d10} bludgeoning damage on a failed save, or half as much damage on a successful one.",
      "A creature you are grappling when you cast this spell travels with you, making the saving throw at disadvantage .",
      "If you cast this spell while airborne, the radius of the area of effect increases by 5 feet for each 10 feet you are above your target location, up to a maximum of 30 feet. You still take fall damage."
    ],
    "components": {"v": true},
    "entriesHigherLevel": [{
      "entries": ["At Higher Levels. When you cast this spell using a spell slot of 4th level or higher, the damage of the spell increases by {@dice 1d10} for each slot level above the third. At 5th level creatures who fail the saving throw are also knocked prone."],
      "name": "At Higher levels",
      "type": "entries"
    }],
    "source": "Magical Martial Maneuvers", "level":"3",
    "school": "V",
    "name": "Meteor Drop",
    "range": {
      "distance": {
        "amount": "30",
        "type": "feet"
      },
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "action"
    }]
  },
  {
    "duration": [{"type": "instant"}],
    "entries": [
      "Nystul's Crystal Dagger",
      "3rd-level transmutation",
      "You conjure a splendid shard of light and hurl it at a creature within range. Make a ranged spell attack against the target. If you hit, you deal {@dice 4d12} force damage. If you miss, the shard reassembles and returns to you. You regain an expended spell slot of level 2 or lower."
    ],
    "components": {"v": true},
    "entriesHigherLevel": [{
      "entries": ["At Higher Levels. When you cast this spell using a spell slot of 4th level or higher, the damage of the spell increases by {@dice 1d12} for each slot level above the third. You can regain a spell slot below the spell slot used to cast it."],
      "name": "At Higher levels",
      "type": "entries"
    }],
    "source": "Magical Martial Maneuvers", "level":"3",
    "school": "T",
    "name": "Nystul's Crystal Dagger",
    "range": {
      "distance": {
        "amount": "90",
        "type": "feet"
      },
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "action"
    }]
  },
  {
    "duration": [{"type": "instant"}],
    "entries": [
      "Projected Attack",
      "3rd-level evocation",
      "As part of the action used to cast this spell, you must make a melee weapon attack against one creature or location within the spell's range. Depending on the damage the weapon deals, the spell has a different effect:",
      "Slashing. A crescent of energy races from the attack, and each creature in a 30-foot cone (oriented as you choose) in the direction of the target must make a Dexterity saving throw.",
      "Piercing. A pure beam of energy streams from the attack, and each creature in a 60-foot line, 5 foot wide line must make a Dexterity saving throw.",
      "Bludgeoning. Explosive energy emanates from the attack, and each creature other than you within 10 feet of the target must make a Dexterity saving throw.",
      "On a failed save, creatures take {@dice 2d10} radiant damage, are pushed back 10 feet from the target of your attack, and fall prone. A creature that is hit with your attack has disadvantage on the save, and on failed save takes {@dice 2d10} radiant damage, is pushed back 10 feet from you and falls prone."
    ],
    "components": {"v": true},
    "entriesHigherLevel": [{
      "entries": ["At Higher Levels. When you cast this spell using a spell slot of 4th level or higher, the damage of the spell increases by {@dice 1d10} for each slot level above the third."],
      "name": "At Higher levels",
      "type": "entries"
    }],
    "source": "Magical Martial Maneuvers", "level":"3",
    "school": "V",
    "name": "Projected Attack",
    "range": {
      "distance": {
        "amount": "5",
        "type": "feet"
      },
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "action"
    }]
  },
  {
    "duration": [{
      "duration": {
        "amount": "minute",
        "type": "minute"
      },
      "concentration": true,
      "type": "timed"
    }],
    "entries": [
      "Thunderwreathed Fists",
      "3rd-level evocation",
      "Energy lances up your arms as you imbue your blows with booming energy of the thunder demiplane, accelerating them to supersonic speeds. For the duration, you use your spellcasting ability modifier for the attack and damage rolls of unarmed strikes. When you use the Attack action with an unarmed strike on your turn, you can make one unarmed strike as a bonus action. Your unarmed strikes deal an additional {@dice 1d8} thunder damage, and when you hit a creature with an unarmed strike, it is pushed 5 feet directly away from you.",
      "On a hit, you can channel the spell's energy into a final blow, ending the spell. Each creature within a 20 foot cone in the direction of your attack must make a Dexterity saving throw. On a failed save, they take {@dice 4d8} thunder damage and fall prone. On a success, they take half damage and suffer no other effects."
    ],
    "components": {"v": true},
    "entriesHigherLevel": [{
      "entries": ["At Higher Levels. When you cast this spell using a spell slot of 4th level or higher, the damage of the spell increases by {@dice 1d8} for each slot level above the third. The damage of the final attack also increases by 1d8."],
      "name": "At Higher levels",
      "type": "entries"
    }],
    "source": "Magical Martial Maneuvers", "level":"3",
    "school": "V",
    "name": "Thunderwreathed Fists",
    "range": {
      "distance": {},
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "action"
    }]
  },
  {
    "duration": [{"type": "instant"}],
    "entries": [
      "Transfixing Daggers",
      "3rd-level transmutation",
      "You cast a flurry of shimmering daggers forward. Each creature in a 20-foot cone must succeed on a Dexterity saving throw. A creature takes {@dice 6d4} slashing damage on a failed save, or half damage on a success.",
      "Immediately after casting this spell, you can use your bonus action to call the daggers back. After reaching the end of the range of the spell, the daggers slow to a stop, reverse, and speed back towards you. Creatures in the area of effect who failed the first save must make another Dexterity saving throw or take the damage again.",
      "A creature within 5 feet of you has disadvantage on these saves."
    ],
    "components": {"v": true},
    "entriesHigherLevel": [{
      "entries": ["At Higher Levels. When you cast this spell using a spell slot of 4th level or higher, the damage of the spell increases by {@dice 2d4} for each slot level above the third."],
      "name": "At Higher levels",
      "type": "entries"
    }],
    "source": "Magical Martial Maneuvers", "level":"3",
    "school": "T",
    "name": "Transfixing Daggers",
    "range": {
      "distance": {
        "amount": "20",
        "type": "feet"
      },
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "action"
    }]
  },
  {
    "duration": [{
      "duration": {
        "amount": "minute",
        "type": "minute"
      },
      "concentration": true,
      "type": "timed"
    }],
    "entries": [
      "Acidwrought Glaive",
      "4th-level evocation",
      "You slam your hands into the ground, and draw out a demonic emerald blade. The weapon is similar in size and shape as a glaive, which lasts for the duration. If you let go of the blade, it disappears, but you can evoke the blade again as a bonus action.",
      "While you are wielding this weapon with both hands, you can use your action to make a melee spell attack at a creature in range, dealing {@dice 2d10} acid damage on a hit. On a hit, you can choose another creature within 5 feet of the original target and within range and repeat this attack against that creature.",
      "Alternatively, you can use your action to end the spell, and make an attack roll on each creature within reach, dealing {@dice 6d10} damage on a hit."
    ],
    "components": {"v": true},
    "entriesHigherLevel": [{
      "entries": ["At Higher Levels. When you cast this spell using a spell slot of 5th level or higher, the damage the spell deals increases by {@dice 1d6} for each slot level above the fourth."],
      "name": "At Higher levels",
      "type": "entries"
    }],
    "source": "Magical Martial Maneuvers", "level":"4",
    "school": "V",
    "name": "Acidwrought Glaive",
    "range": {
      "distance": {
        "amount": "10",
        "type": "feet"
      },
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "bonus action"
    }]
  },
  {
    "duration": [{"type": "instant"}],
    "entries": [
      "Attractor Pulse",
      "4th-level evocation",
      "You throw an orb of dark energy out to a location within range. A line of lightning streaks out, pulling creatures towards it before a thunderous boom sounds forth. Each creature you choose within 30 feet of a point within range must make a Dexterity saving throw. On a failure, it takes {@dice 4d10} lightning damage and be pulled 20 feet in a straight line towards the origin of the area of effect. On a success, it takes half damage and is not pulled.",
      "An 10 foot radius area centered at that point crackles with latent magical energy. Until the start of your next turn, the area is considered dimly lit and difficult terrain. At the start of your next turn, creatures other than you in the area must make a Dexterity saving throw, taking {@dice 4d10} thunder damage and falling {@condition prone} on a failure, or half damage on a success."
    ],
    "components": {"v": true},
    "entriesHigherLevel": [{
      "entries": ["At Higher Levels. When you cast this spell using a spell slot of 5th level or higher, the damage the spell deals increases by {@dice 1d10} for each slot level above the fourth."],
      "name": "At Higher levels",
      "type": "entries"
    }],
    "source": "Magical Martial Maneuvers", "level":"4",
    "school": "V",
    "name": "Attractor Pulse",
    "range": {
      "distance": {},
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "action"
    }]
  },
  {
    "duration": [{
      "duration": {
        "amount": "minute",
        "type": "minute"
      },
      "type": "timed"
    }],
    "entries": [
      "Fangs of the Storm Serpent",
      "4th-level transmutation",
      "",
      "Electricity pulses from your hands and envelopes your blades in bright sparking energy. You can use your spellcasting ability instead of strength or dexterity for the attack and damage rolls of attacks with these weapons, which each deal an additional {@dice 2d6} damage lightning damage the first time you hit with the weapon each turn.",
      "Additionally, a magical connection is forged between each weapon and the hand that holds it. After using an action or bonus action to make an attack with one of these weapons, you can teleport the blade back into your hand or teleport up to 30 feet to where the blade struck a creature."
    ],
    "components": {"v": true},
    "entriesHigherLevel": [{
      "entries": ["At Higher Levels. When you cast this spell using a spell slot of 5th level or higher, the damage of the spell attack increases by {@dice 1d6} for each slot level above the fourth."],
      "name": "At Higher levels",
      "type": "entries"
    }],
    "source": "Magical Martial Maneuvers", "level":"4",
    "school": "T",
    "name": "Fangs of the Storm Serpent",
    "range": {
      "distance": {},
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "action"
    }]
  },
  {
    "duration": [{
      "duration": {
        "amount": "hour.",
        "type": "hour."
      },
      "concentration": true,
      "type": "timed"
    }],
    "entries": [
      "Haunt",
      "4rd-level conjuration",
      "You mark a hostile creature to be the singular focus of your hunt. You always know where the creature is, and it can never be hidden from you. In addition, you can sense what areas are in the target's line of sight. On a subsequent turn, you can use your bonus action to teleport within 30 feet of the target as long as the location isn't in the target's line of sight. This teleportation only works if you and the creature are on the same plane."
    ],
    "components": {"v": true},
    "source": "Magical Martial Maneuvers", "level":"10",
    "school": "C",
    "name": "Haunt",
    "range": {
      "distance": {},
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "bonus action"
    }]
  },
  {
    "duration": [{
      "duration": {
        "amount": "minute",
        "type": "minute"
      },
      "concentration": true,
      "type": "timed"
    }],
    "entries": [
      "Gleam",
      "4th-level divination",
      "You peer into the machinations of an enemy's mind, and use this information against them. A creature in range that you can see must make a Charisma saving throw. On a failure, you have advantage on all attacks against them and they have disadvantage on all attacks against you until the end of their next turn.",
      "You automatically know the target’s\tlocation. The target can never be hidden from you. You can see through any illusions conjured by the target, or of the target. Any time that creature would need to guess your location (for example, if there are multiple images of you because you are hidden), it guesses wrong.",
      "You can subject another creature to this effect as a bonus action on a subsequent turn. A creature who succeeds on the Charisma saving throw is immune to the effects of this spell from you for the next 24 hours."
    ],
    "components": {"v": true},
    "source": "Magical Martial Maneuvers", "level":"4",
    "school": "D",
    "name": "Gleam",
    "range": {
      "distance": {
        "amount": "10",
        "type": "feet"
      },
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "bonus action"
    }]
  },
  {
    "duration": [{
      "duration": {
        "amount": "minute",
        "type": "minute"
      },
      "concentration": true,
      "type": "timed"
    }],
    "entries": [
      "Phasewalk",
      "4th-level transmutation",
      "Once per turn, one uninterrupted segment of movement counts as magical teleportation for you. Each 5 feet of Phasewalk costs 10 feet of movement. You don't provoke opportunity attacks, you aren't considered to have entered in an spell or effect's area unless you end your movement there, and traps based on location don't go off.",
      "",
      "You can enter a creature's space with this movement, and the first time each turn you do so the creature must make succeed on a Dexterity saving throw or take {@dice 2d6} electric damage. If you make an attack at the end of this movement, it is at advantage as your weapon teleports directly into the creatures space.",
      "You emit an audible hum and bright afterimage lasts throughout the teleported movement, illuminating areas within 10 feet of your path until the start of your next turn."
    ],
    "components": {"s": true},
    "entriesHigherLevel": [{
      "entries": ["At Higher Levels. When you cast this spell using a spell slot of 5th level or higher, the damage spell increases by {@dice 1d6} for each slot level above the fourth."],
      "name": "At Higher levels",
      "type": "entries"
    }],
    "source": "Magical Martial Maneuvers", "level":"4",
    "school": "T",
    "name": "Phasewalk",
    "range": {
      "distance": {},
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "action"
    }]
  },
  {
    "duration": [{"type": "instant"}],
    "entries": [
      "Sacrificial Dagger",
      "4th-level necromancy",
      "You imbue a blade with a sacrificial curse and plunge it into an enemy. Make a melee spell attack against a creature within range, dealing {@dice 2d12} piercing damage on a hit. If it hits, every creature other than you within 30 feet of you must make a Wisdom saving throw. On a failed save, a ghostly specter appears within 5 feet of that creature and stabs them as well, dealing {@dice 4d12} necrotic damage.",
      "Alternatively, you can stab yourself or a willing ally with the blade, which automatically hits causing irreducible damage, and causes creatures other than the target within 30 feet to make the save at disadvantage."
    ],
    "components": {"v": true},
    "entriesHigherLevel": [{
      "entries": ["At Higher Levels. When you cast this spell using a spell slot of 5th level or higher, the damage of the area of effect increases by {@dice 1d12} for each slot level above the fourth."],
      "name": "At Higher levels",
      "type": "entries"
    }],
    "source": "Magical Martial Maneuvers", "level":"4",
    "school": "N",
    "name": "Sacrificial Dagger",
    "range": {
      "distance": {
        "amount": "5",
        "type": "feet"
      },
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "action"
    }]
  },
  {
    "duration": [{
      "duration": {
        "amount": "turn",
        "type": "turn"
      },
      "type": "timed"
    }],
    "entries": [
      "Shadow Clone",
      "4th-level illusion",
      "You teleport to an unoccupied location within range, leaving behind an illusory clone. Each creature within 30 feet of the clone must make a Wisdom saving throw. On a failure, they believe that the shadow is you until the end of their next turn. The target rationalizes any illogical outcomes from interacting with the shadow clone.",
      "A creature is unaffected by this spell if it can't see, if it relies on senses other than sight, such as blindsight, or if it can perceive illusions as false, as with truesight. A creature who is immune to being {@condition charmed} is also immune to this effect.",
      "If you ready this spell, you can choose to release it when you are targeted by a harmful effect leaving a shadowy clone to take the blunt of the blow while you teleport away. Targets automatically succeed on the Wisdom save, but the harmful effect fails if it can no longer target you."
    ],
    "components": {"s": true},
    "source": "Magical Martial Maneuvers", "level":"4",
    "school": "I",
    "name": "Shadow Clone",
    "range": {
      "distance": {
        "amount": "90",
        "type": "feet"
      },
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "action"
    }]
  },
  {
    "duration": [{
      "duration": {
        "amount": "minute",
        "type": "minute"
      },
      "concentration": true,
      "type": "timed"
    }],
    "entries": [
      "Spirit Warrior",
      "4th-level conjuration",
      "You summon a humanoid creature in unoccupied spaces within range. It has your ability scores, proficencies, AC, and wields a spectral copy of the weapon you used to cast this spell. They deal an additional {@dice 2d6} psychic damage on a hit and can make attacks of opportunity. When a spirit warrior takes damage, you must succeed on a saving throw using your spellcasting ability against a DC equal to half the damage dealt to it or it disappears.",
      "A spirit warrior takes their turn on your initiative, though it doesn't take an action unless you telepathically command it to. On your turn, you can telepathically command each spirit warrior to move to a location within range of you (no action required by you). You can use the Attack action to telepathically command a spirit warrior to make a melee weapon attack at a creature within its reach. If you are able to make multiple attacks with the Attack action, this attack replaces one of them."
    ],
    "components": {"v": true},
    "entriesHigherLevel": [{
      "entries": ["At Higher Levels. When you cast this spell using a spell slot of 5th or higher, you summon one additional spirit warrior for each slot level above the fourth."],
      "name": "At Higher levels",
      "type": "entries"
    }],
    "source": "Magical Martial Maneuvers", "level":"4",
    "school": "C",
    "name": "Spirit Warrior",
    "range": {
      "distance": {
        "amount": "30",
        "type": "feet"
      },
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "action"
    }]
  },
  {
    "duration": [{"type": "instant"}],
    "entries": [
      "Spike of Dis",
      "4th-level conjuration",
      "You imbue your weapon with the curse of Dis's kiss and make an overhead strike. Make a melee spell attack against a creature within range, dealing {@dice 2d12} piercing damage on a hit.",
      "On a hit or a miss, you can use your bonus action to summon thin barbed spikes that rupture from the 5-foot square attacked. The creature must succeed on a Dexterity saving throw or take {@dice 2d12} piercing damage and be {@condition restrained} until it uses its action to free itself."
    ],
    "components": {"v": true},
    "entriesHigherLevel": [{
      "entries": ["At Higher Levels. When you cast this spell using a spell slot of 5th level or higher, the damage of the spell attack and area of effect increases by {@dice 1d12} for each slot level above the third."],
      "name": "At Higher levels",
      "type": "entries"
    }],
    "source": "Magical Martial Maneuvers", "level":"4",
    "school": "C",
    "name": "Spike of Dis",
    "range": {
      "distance": {
        "amount": "5",
        "type": "feet"
      },
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "action"
    }]
  },
  {
    "duration": [{"type": "instant"}],
    "entries": [
      "Temporal Thrust",
      "4th-level evocation",
      "You brace yourself and briefly thrust yourself through the ethereal plane, teleporting to a location within range. Immediately after this teleport, you can attempt to shove a creature through time as part of the spell. The creature must instead make a Charisma saving throw.",
      "On a failed save one of the effects below occurs (your choice):",
      "Temporal Jump. The target is banished to a harmless demiplane until the end of its next turn. While there, the target is Incapacitated. No time passes for the target while it is banished.",
      "Temporal Acceleration. The target is banished to a harmless demiplane until the start of its next turn. Any spells affecting the target with a duration less than one hour end, as well as any such spells the target is concentrating on.",
      "After the effect, the target appears 15 feet away from the location you teleported to, in a straight line. If there isn't a clear path to the destination, the creature appears in front of the obstruction."
    ],
    "components": {"v": true},
    "source": "Magical Martial Maneuvers", "level":"4",
    "school": "V",
    "name": "Temporal Thrust",
    "range": {
      "distance": {
        "amount": "15",
        "type": "feet"
      },
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "bonus action"
    }]
  },
  {
    "duration": [{
      "duration": {
        "amount": "minute",
        "type": "minute"
      },
      "concentration": true,
      "type": "timed"
    }],
    "entries": [
      "Umbral Assault",
      "4th-level necromancy",
      "When you cast this spell, you separate your shadow from your body. Until the spell ends, you can control your shadow and cause it to move by expending your own movement. You can also cause it to make up to three melee spell attacks (no action required). These attacks target one creature within 5 feet of the shadow, dealing {@dice 3d6} necrotic damage on a hit. If your shadow reduces a creature to 0 hit points their body is hidden in magical darkness until dispelled.",
      "Your shadow does not provoke opportunity attacks and can pass through small holes, narrow openings, and even mere cracks, though it must remain within 5 feet of a solid surface at any time. Your shadow is silent, and {@condition invisible} in darkness.",
      "The spell ends once your shadow makes its 3 attacks or takes any damage. While you are concentrating on this spell you are {@condition blinded} and you see through your shadow, which has darkvision for 120 feet and can also see through magical darkness."
    ],
    "components": {"v": true},
    "entriesHigherLevel": [{
      "entries": ["At Higher Levels. When you cast this spell using a spell slot of 5th-level or higher, the shadow makes an additional attack for each slot level above the fourth."],
      "name": "At Higher levels",
      "type": "entries"
    }],
    "source": "Magical Martial Maneuvers", "level":"4",
    "school": "N",
    "name": "Umbral Assault",
    "range": {
      "distance": {
        "amount": "120",
        "type": "feet"
      },
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "action"
    }]
  },
  {
    "duration": [{
      "duration": {
        "amount": "round",
        "type": "round"
      },
      "type": "timed"
    }],
    "entries": [
      "Agonizing Whip",
      "5th-level evocation",
      "You coalesce an whip out of pure coalesced pain that hums with the faint screams of horrors inflicted past. When you cast this spell, you make 3 melee spell attacks at creatures within range.",
      "If at least two of your attacks hit the same creature, the creature must make a Constitution saving throw or be {@condition incapacitated} until the end of their next turn. If three hit, the creature is {@condition stunned} for the same duration."
    ],
    "components": {"v": true},
    "entriesHigherLevel": [{
      "entries": ["At Higher Levels. When you cast this spell using a spell slot of 6th-level or higher, you make an additional attack for each slot level above 5th."],
      "name": "At Higher levels",
      "type": "entries"
    }],
    "source": "Magical Martial Maneuvers", "level":"5",
    "school": "V",
    "name": "Agonizing Whip",
    "range": {
      "distance": {
        "amount": "15",
        "type": "feet"
      },
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "action"
    }]
  },
  {
    "duration": [{
      "duration": {
        "amount": "minute",
        "type": "minute"
      },
      "concentration": true,
      "type": "timed"
    }],
    "entries": [
      "Blade Wings",
      "5th-level transmutation",
      "You summon 8 glowing hilt-less blades that fan out behind your back. Until the spell ends you can use these blades in magical maneuvers:",
      "You use your action to throw out 4 of your blades. Creatures in 5 foot wide 30 foot line must make a Dexterity saving throw or take {@dice 4d10} slashing damage on a failed save and half damage on a successful one.",
      "You can use your bonus action to throw out one of the blades. Make a ranged spell attack, dealing {@dice 3d10} piercing damage on a hit.",
      "You can use your action to sweep the blades forward. Creatures in 15 foot cone must succeed on a Dexterity saving throw or take {@dice 2d10} slashing damage and half damage on a successful save.",
      "A thrown blade falls to the floor and crumbles into rust. While you have at least 4 of your blades you gain a flying speed of 30 feet."
    ],
    "components": {"v": true},
    "source": "Magical Martial Maneuvers", "level":"5",
    "school": "T",
    "name": "Blade Wings",
    "range": {
      "distance": {
        "amount": "10",
        "type": "feet"
      },
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "action"
    }]
  },
  {
    "duration": [{"type": "instant"}],
    "entries": [
      "Chromatic Blast",
      "5th-level evocation",
      "You gather up elemental energy in one of your hands and prepare to expel it into an enemy. Choose acid, cold, fire, lightning, poison, or thunder for the type of energy.",
      "You can use your spellcasting modifier for attack and damage rolls for unarmed strikes. On a hit, you deal {@dice 3d10} damage of the type you chose. Additionally, you can choose to use your bonus action to transfer the enchantment onto the target, ending the spell.",
      "If the target is a Large or smaller creature, it is pushed up to 30 feet away from you in a straight line (you choose). If the target is an object a glowing rune is left in the crater of your attack.",
      "At the end of your turn, each creature within 20 feet of the target's location must make a Dexterity saving throw or take {@dice 8d10} damage of the type you chose. The target has disadvantage on the saving throw."
    ],
    "components": {"v": true},
    "source": "Magical Martial Maneuvers", "level":"5",
    "school": "V",
    "name": "Chromatic Blast",
    "range": {
      "distance": {},
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "action"
    }]
  },
  {
    "duration": [{
      "duration": {
        "amount": "round",
        "type": "round"
      },
      "type": "timed"
    }],
    "entries": [
      "Earth shatter",
      "5th-level evocation",
      "You slam your weapon into the ground, releasing a torrent of energy at a location within range. Creatures within a 5 by 5 cube at the target location must make a Dexterity saving throw or take {@dice 4d10} thunder damage and be flung 20 feet into the air. On a success they take half damage and aren't flung.",
      "Each creature within a 15 feet wide line emanating from you towards the target location must make a Dexterity saving throw. On a failure they take {@dice 2d10} bludgeoning damage and fall prone. On a success they take half damage and don't fall prone."
    ],
    "components": {"v": true},
    "source": "Magical Martial Maneuvers", "level":"5",
    "school": "V",
    "name": "Earth shatter",
    "range": {
      "distance": {
        "amount": "40",
        "type": "feet"
      },
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "action"
    }]
  },
  {
    "duration": [{
      "duration": {
        "amount": "minute",
        "type": "minute"
      },
      "concentration": true,
      "type": "timed"
    }],
    "entries": [
      "Flashing Blade",
      "5th-level necromancy",
      "Whenever you make an attack on your turn, you can draw the weapon you use to cast this spell and move up to 15 feet without provoking opportunity attacks prior to the attack. Immediately after that attack, you return to your original position and sheathe your weapon.",
      "When a creature within the range of your spell uses an action, you can use your reaction to make a melee weapon attack. If you hit the target, the target must make a Concentration check or the target's action fails (a spell fails to cast and the spell slot is expended, an attack misses). Additionally, once per turn, you can make a melee attack against any creature that moves more than 5 feet while within the range of your spell."
    ],
    "components": {"s": true},
    "source": "Magical Martial Maneuvers", "level":"5",
    "school": "N",
    "name": "Flashing Blade",
    "range": {
      "distance": {
        "amount": "15",
        "type": "feet"
      },
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "action"
    }]
  },
  {
    "duration": [{
      "duration": {
        "amount": "minute",
        "type": "minute"
      },
      "concentration": true,
      "type": "timed"
    }],
    "entries": [
      "Larloch's Fervid Blade",
      "5th-level necromancy",
      "You make a silent oath against one creature within range that you can see and draw out a black spectral katana from your sheath. Despite the distance between you and your target, your attacks will ring true. Make a melee spell attack against that creature, dealing {@dice 5d12} necrotic damage on a hit, ignoring any bonuses to cover. You can repeat this action on a subsequent turn, targeting the same creature as long as the target isn't outside the spell’s range and doesn't have total cover from you."
    ],
    "components": {"s": true},
    "entriesHigherLevel": [{
      "entries": ["At Higher Levels. When you cast this spell using a spell slot of 6th level or higher, the damage of the spell increases by {@dice 1d12} for each slot level above the fifth."],
      "name": "At Higher levels",
      "type": "entries"
    }],
    "source": "Magical Martial Maneuvers", "level":"5",
    "school": "N",
    "name": "Larloch's Fervid Blade",
    "range": {
      "distance": {
        "amount": "30",
        "type": "feet"
      },
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "action"
    }]
  },
  {
    "duration": [{
      "duration": {
        "amount": "minute",
        "type": "minute"
      },
      "concentration": true,
      "type": "timed"
    }],
    "entries": [
      "Nature's Golem",
      "5th-level conjuration",
      "Vines and stone wreath themselves to form a Large golem underneath you, which is under your control until the spell ends or until it is reduced to 0 hit points.",
      "An Nature Golem is a construct with AC of 15, 50 hit points, and a Strength and Dexterity of 18. Its Constitution is 10 and its Intelligence, Wisdom, and Charisma are 3. Its speed is 40 feet and it has blindsight with a radius of 30 feet and is blind beyond that distance. While mounted on the creature, you can command it to attack using a bonus action. (Attack: +8 to hit, {@dice 2d12} + 4 bludgeoning damage).",
      "Alternatively, you can merge with the Golem using a bonus action to assume direct control. You gain 50 temporary hit points, you have advantage on Athletics checks and Concentration checks, your speed is doubled, and your size becomes Large. The spell ends when you run out of these temporary hit points. The golem extrudes oversized rock imitations of your weapons which you use to deal twice your weapon damage on a hit."
    ],
    "components": {"v": true},
    "source": "Magical Martial Maneuvers", "level":"5",
    "school": "C",
    "name": "Nature's Golem",
    "range": {
      "distance": {
        "amount": "10",
        "type": "feet"
      },
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "action"
    }]
  },
  {
    "duration": [{"type": "instant"}],
    "entries": [
      "Prognosticated Blow",
      "5th-level divination",
      "You invoke a causality-reserving effect on a weapon and curse a creature within range to realize their inevitable impending pain. The target must make a Wisdom saving throw. On a failure, it takes {@dice 2d12} psychic damage and your next attack on the creature is \"foretold\"- it automatically hits and deals the psychic damage again. On a success the target takes half damage and your next attack has advantage instead."
    ],
    "components": {"v": true},
    "source": "Magical Martial Maneuvers", "level":"5",
    "school": "D",
    "name": "Prognosticated Blow",
    "range": {
      "distance": {},
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "bonus action"
    }]
  },
  {
    "duration": [{
      "duration": {
        "amount": "minute",
        "type": "minute"
      },
      "concentration": true,
      "type": "timed"
    }],
    "entries": [
      "Rimestrike",
      "5th-level evocation",
      "You evoke the chill of the demiplane of ice blade in your hilt. The blade that extrudes from it is similar in size and shape to a greatsword, and it lasts for the Duration.",
      "While you are wielding this blade you can use an action to make a melee spell attack at a creature within 5 feet, dealing {@dice 6d6} damage on a hit and chilling them until the end of their next turn. A chilled enemy has their their speed reduced to half and can't take reactions.",
      "On a hit, you can also choose to leave the blade stuck in the target. The creature is {@condition restrained} for the duration and takes {@dice 6d6} cold damage at the start of each of its turns. At the end of each of its turns, the target can make a Constitution saving throw, ending the spell on a success.",
      "A creature killed by this spell becomes a frozen statue until it thaws."
    ],
    "components": {"v": true},
    "entriesHigherLevel": [{
      "entries": ["At Higher Levels. When you cast this spell using a spell slot of 6th level or higher, the damage of the spell (both inital and subsequent) increases by {@dice 1d6} for each slot level above the fifth."],
      "name": "At Higher levels",
      "type": "entries"
    }],
    "source": "Magical Martial Maneuvers", "level":"5",
    "school": "V",
    "name": "Rimestrike",
    "range": {
      "distance": {},
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "bonus action"
    }]
  },
  {
    "duration": [{
      "duration": {
        "amount": "round",
        "type": "round"
      },
      "type": "timed"
    }],
    "entries": [
      "Shade Splice",
      "5th-level necromancy",
      "You summon a sliver of shadow essence from the shadowfell, exchange part of your soul with it, and manifest 3 shades. Shades are invulnerable to damage, but can interact physically with the world and have your stats. Each shade moves up to 30 feet and can touch a creature within 5 feet of them. Make a melee spell attack, dealing {@dice 3d10} necrotic damage on a hit.",
      "Each shade has a reaction, which it can use to repeat its attack as an opportunity attack. At the beginning of your next turn, you can teleport to the location of one of your shades."
    ],
    "components": {"v": true},
    "source": "Magical Martial Maneuvers", "level":"5",
    "school": "N",
    "name": "Shade Splice",
    "range": {
      "distance": {
        "amount": "30",
        "type": "feet"
      },
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "action"
    }]
  },
  {
    "duration": [{"type": "instant"}],
    "entries": [
      "Slice World",
      "5th-level transmutation",
      "You draw upon the destructive energies from the shadowfell and swing your weapon in front of you. Whisps of shadow transport the material it contacts to the shadowfell.",
      "You are able to cut through a flat plane with an area no larger than 20 5-by-5 square feet sections. The area you cut through must be contiguous and fall within a 30 foot cone. Alternatively, you can make several quick slashes that completely disintegrate material in a 10 foot cube area in front of you."
    ],
    "components": {"v": true},
    "source": "Magical Martial Maneuvers", "level":"5",
    "school": "T",
    "name": "Slice World",
    "range": {
      "distance": {},
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "action"
    }]
  },
  {
    "duration": [{
      "duration": {
        "amount": "minute.",
        "type": "minute."
      },
      "concentration": true,
      "type": "timed"
    }],
    "entries": [
      "Spectral Stampede",
      "5th-level conjuration",
      "A stampede of spectral wildlife charges forth in a line 30 feet long and 15 feet wide emanating from you in a direction you choose. When a creature enters the spell's area for the first time on a turn or starts its turn there, that creature must make a Dexterity saving throw. On a failed save, the creature takes {@dice 8d6} psychic damage and falls prone. On a success, it takes half as much damage and doesn't fall prone. A creature has disadvantage on the save if it was already prone.",
      "A hostile creature treats the area of the spell as difficult terrain. Hostile creatures in the area of effect can't take reactions."
    ],
    "components": {"v": true},
    "source": "Magical Martial Maneuvers", "level":"5",
    "school": "C",
    "name": "Spectral Stampede",
    "range": {
      "distance": {
        "amount": "30",
        "type": "feet"
      },
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "action"
    }]
  },
  {
    "duration": [{
      "duration": {
        "amount": "round",
        "type": "round"
      },
      "type": "timed"
    }],
    "entries": [
      "Caustic Blade",
      "evocation cantrip",
      "You imbue your blade with a highly corrosive acid and make a wide lunging slash with it. As part of the action used to cast this spell, you must make a melee attack with a weapon against each creature within the area of effect, which is a 5 foot cube within range, otherwise the spell fails. Your target does not gain the benefit of cover as long as that cover is made out of nonmagical material.",
      "At 5th level, the area of the spell increases to two adjacent 5-foot cubes. At 11th level this increases to 3 cubes, and at 17th it increases to 4. You can break up your movement between attacks, which require a separate attack for each target. The second time a creature is hit with an attack from a casting of this spell, it takes your spellcasting modifier in acid damage instead of the attacks' normal effects."
    ],
    "components": {"v": true},
    "source": "Magical Martial Maneuvers", "level":"10",
    "school": "X",
    "name": "Caustic Blade",
    "range": {
      "distance": {
        "amount": "5",
        "type": "feet"
      },
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "action"
    }]
  },
  {
    "duration": [{
      "duration": {
        "amount": "dispelled.",
        "type": "dispelled."
      },
      "type": "timed"
    }],
    "entries": [
      "Eldritch Blade",
      "evocation cantrip",
      "You create a weapon in your empty hand that has the stats of a dagger and can be used as a spellcasting focus for your warlock spells. Use your spellcasting attack modifier for attack and damage rolls with this weapon. This spell ends if your eldritch blade is more than 5 feet away from you for 1 minute or more. It also ends if you cast this spell again, if you dismiss the weapon (no action required), or if you die. When you cast a warlock spell that uses your eldritch blade as a material component, your blade becomes charged until the end of your next turn.",
      "Using an action, you can make an melee attack with your blade against one creature within reach. On a hit, if your blade was charged, the target takes additional force damage equal to the spell slot level of the spell cast.",
      "This spell's damage increases when you reach higher levels. At 5th level, the melee attack deals an extra {@dice 1d8} force damage to the target, and the force damage due to a charged blade increases to {@dice 1d8} + the spell slot level. Both damage rolls increase by {@dice 1d8} at 11th level and 17th level."
    ],
    "components": {"v": true},
    "source": "Magical Martial Maneuvers", "level":"10",
    "school": "X",
    "name": "Eldritch Blade",
    "range": {
      "distance": {},
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "action"
    }]
  },
  {
    "duration": [{
      "duration": {
        "amount": "turn",
        "type": "turn"
      },
      "type": "timed"
    }],
    "entries": [
      "Flashpalm",
      "evocation cantrip",
      "You open your clenched hand and a glaring light pulses out, disorienting a creature within range that can see you. The target must make a Constitution saving throw. On a failed save, the target takes {@dice 1d4} radiant damage, and it {@condition blinded} until the end of the turn.",
      "The spell's damage increases by {@dice 1d4} when you reach 5th level (2d4), 11th level (3d4), and 17th level (4d4)."
    ],
    "components": {"v": true},
    "source": "Magical Martial Maneuvers", "level":"10",
    "school": "X",
    "name": "Flashpalm",
    "range": {
      "distance": {
        "amount": "5",
        "type": "feet"
      },
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "action"
    }]
  },
  {
    "duration": [{"type": "instant"}],
    "entries": [
      "Sending Blade",
      "evocation cantrip",
      "As part of the action used to cast this spell, you must make a ranged attack with a melee weapon against one creature within the spell's range, otherwise the spell fails. Your magic accelerates your weapon to uncannny speeds over the course of its trajectory. On a hit, the target suffers the attack's normal effects. If this attack is at long range it isn't at disadvantage and deals additional piercing damage equal to your spellcasting modifier.",
      "Alternatively, you can cast this cantrip on a weapon that doesn't have the thrown property. It gains a thrown range of 20/60 until the end of your next turn and floats in the air close at hand, vibrating softly.",
      "This spell's damage increases when you reach higher levels. At 5th level, the attack deals an extra {@dice 1d8} piercing damage to the target, and the damage of the spell if the the target is at long range increases to {@dice 1d8} + your spellcasting modifier. Both damage rolls increase by {@dice 1d8} at 11th level and 17th level."
    ],
    "components": {"v": true},
    "source": "Magical Martial Maneuvers", "level":"10",
    "school": "X",
    "name": "Sending Blade",
    "range": {
      "distance": {
        "amount": "60",
        "type": "feet"
      },
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "action"
    }]
  },
  {
    "duration": [{
      "duration": {
        "amount": "round",
        "type": "round"
      },
      "type": "timed"
    }],
    "entries": [
      "Siphoning Strike",
      "necromancy cantrip",
      "As part of the action used to cast this spell, you must make a melee attack with a weapon against one creature within the spell's range, otherwise the spell fails. On a hit, the target suffers the attack's normal effects and if you reduce a hostile creature to 0 hit points, you siphon off a bit of its soul. Your next attack with that weapon before the end of your next turn deals additional damage equal to your spellcasting modifier.",
      "This spell's damage increases when you reach higher levels. At 5th level, the melee attack deals an extra {@dice 1d8} necrotic damage to the target, and the necrotic damage to the following attack increases to {@dice 1d8} + your spellcasting ability modifier. Both damage rolls increase by {@dice 1d8} at 11th level and 17th level."
    ],
    "components": {"v": true},
    "source": "Magical Martial Maneuvers", "level":"10",
    "school": "X",
    "name": "Siphoning Strike",
    "range": {
      "distance": {
        "amount": "5",
        "type": "feet"
      },
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "action"
    }]
  },
  {
    "duration": [{
      "duration": {
        "amount": "minute.",
        "type": "minute."
      },
      "concentration": true,
      "type": "timed"
    }],
    "entries": [
      "Rimeshard",
      "conjuration cantrip",
      "You use your magic to crystalize a pristine glass-like weapon out of thin air. The weapon can take on the form of any melee weapon, which sublimates into nothingness at the end of your turn unless you are wielding it.",
      "An attack with the weapon does cold damage instead of its normal type, and if you score a critical hit with it, it shatters and deals an additional {@dice 1d12} cold damage. When you cast this spell, you can conjure two weapons, one in each hand, as long as both weapons are light weapons.",
      "The spell's damage on a critical hit increases by {@dice 1d12} when you reach 5th level (2d12), 11th level (3d12), and 17th level (4d12)."
    ],
    "components": {"v": true},
    "source": "Magical Martial Maneuvers", "level":"10",
    "school": "X",
    "name": "Rimeshard",
    "range": {
      "distance": {
        "amount": "10",
        "type": "feet"
      },
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "bonus action."
    }]
  },
  {
    "duration": [{
      "duration": {
        "amount": "round",
        "type": "round"
      },
      "type": "timed"
    }],
    "entries": [
      "Vexatious Blade",
      "enchantment cantrip",
      "",
      "As part of the action used to cast this spell, you must make a melee attack with a weapon against one creature within the spell's range, otherwise the spell fails. On a hit, the target suffers the attack's normal effects, and their mind is shrouded in dark intent until the start of your next turn. If the target doesn't target you with an attack or spell before then, they take {@dice 1d8} psychic damage.",
      "This spell's damage increases when you reach higher levels. At 5th level, the melee attack deals an extra {@dice 1d8} psychic damage to the target, and the damage the target takes for not targeting you increases to 2d8. Both damage rolls increase by {@dice 1d8} at 11th level and 17th level."
    ],
    "components": {"v": true},
    "source": "Magical Martial Maneuvers", "level":"10",
    "school": "X",
    "name": "Vexatious Blade",
    "range": {
      "distance": {
        "amount": "5",
        "type": "feet"
      },
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "action"
    }]
  },
  {
    "duration": [{
      "duration": {
        "amount": "round",
        "type": "round"
      },
      "type": "timed"
    }],
    "entries": [
      "Witchblade",
      "conjuration cantrip",
      "You summon a shard of vile energy and plunge it into a nearby foe. You teleport to an unoccupied location in range and make a melee spell attack at a creature within in reach, dealing {@dice 1d8} poison damage on a hit. After your attack you immediately teleport back to your original location.",
      "The spell's damage increases by {@dice 1d8} when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8)."
    ],
    "components": {"v": true},
    "source": "Magical Martial Maneuvers", "level":"10",
    "school": "X",
    "name": "Witchblade",
    "range": {
      "distance": {
        "amount": "5",
        "type": "feet"
      },
      "type": "point"
    },
    "time": [{
      "number": "1",
      "unit": "action"
    }]
  }
]}